class ApiService {
  getPostsPage(params) {
    const posts = returnPosts();
    const takenPost = posts.slice(0, -params.skip);
    const finalObject = {
      taken: takenPost.length,
      skipped: params.skip + (params.take - takenPost.length),
      items: takenPost
    };

    finalObject.total = finalObject.taken + finalObject.skipped;

    return Promise.resolve(finalObject);
  }
}

const service = new ApiService();
export default service;

function returnPosts() {
  const POSTS = [
    {
      id: 0,
      title: "Поворотам судьбы",
      createdAt: "26-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Странно, но больны на всю голову,</p>
      <p>Неожиданные повороты судьбы.</p>
      <p>Всё недавно делившие поровну</p>
      <p>Разошлись, ускоряя темпы ходьбы.</p>
      <p>Странно, но забыли о справедливости</p>
      <p>Неожиданные повороты судьбы.</p>
      <p>Поощряя живущих в лживости</p>
      <p>Не услышат бедных мольбы.</p>
      <p>Странно, но совсем осмелели</p>
      <p>Неожиданные повороты судьбы.</p>
      <p>Люди делают все, что велели</p>
      <p>Потому что душою слабы.</p>
      <p>Странно, но я больше не доверяю</p>
      <p>Неожиданным поворотам судьбы.</p>
      <p>Я простил их, сейчас отпускаю</p>
      <p>Без обиды, злости, стрельбы...</p>`
    },
    {
      id: 1,
      title: "Мы опять играем в любовь",
      createdAt: "25-02-2019",
      tags: ["любовь", "разное"],
      content: `<p>Мы опять играем в любовь</p>
      <p>Только кто из нас победитель?</p>
      <p>Совершаем ошибки вновь,</p>
      <p>Был дающий - теперь проситель.</p>
      <p>Мы поссоримся сотни раз</p>
      <p>Ну и пусть, разве важно это?</p>
      <p>Чтоб услышать истинность фраз,</p>
      <p>Не такое проходят гетто.</p>
      <p>Мы забудем обиды спустя</p>
      <p>Наслаждение долгой разлуки.</p>
      <p>И мечтая при свете огня,</p>
      <p>Мы подпишем новые муки.</p>
      <p>Мы уснём в тишине мостовых,</p>
      <p>И предел наших чувств - бесконечность.</p>
      <p>В этом мире фигур восковых</p>
      <p>Нам будильником служит вечность.</p>
      <p>Позабыв, что такое душ близость</p>
      <p>Холодеет и стынет кровь.</p>
      <p>Повторять - это вовсе не низость,</p>
      <p>Мы опять сыграем в любовь...</p>`
    },
    {
      id: 2,
      title: "Мы спим днём в электричках немых",
      createdAt: "24-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Мы спим днём в электричках немых,</p>
      <p>А не ночью в роскошных постелях.</p>
      <p>Мы не странные люди, мы тени "других",</p>
      <p>Но как вы не увязли в картелях.</p>
      <p>Мы пробили сотни фальшивых бумаг,</p>
      <p>Контролёры нам братья и сёстры.</p>
      <p>Мы пытались покинуть душевный гулаг,</p>
      <p>Наши мысли наивны и пёстры.</p>
      <p>Мы скитальцы ночных одиноких дорог</p>
      <p>Тех, что вы сторонитесь порою.</p>
      <p>Мы как гномы, что изгнаны все за порог,</p>
      <p>И всё ищем свой дом под горою.</p>
      <p>Мы в стенах самых древних и чудных садов,</p>
      <p>Познаём, то что вами отверглось.</p>
      <p>Мы рабы, но не чувствуем боли оков</p>
      <p>И в глазах наших ясных не смерклось.</p>
      <p>Мы утрами всё чаще глядим на восток</p>
      <p>В ожиданьи надежды и света.</p>
      <p>Мы всё верим и ждём, что наш жизни поток</p>
      <p>Будет ярким как в небе комета...</p>`
    },
    {
      id: 3,
      title: "Монолог о жизни",
      createdAt: "23-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Я видел смерть - у нее нету лица,</p>
      <p>Как сын еще юный теряет отца.</p>
      <p>Я видел затоптаных грязью жнецов,</p>
      <p>Пророков всевидящих, яростных вдов.</p>
      <p>Я видел двуличных и лживых людей,</p>
      <p>Сегодня он - ангел, а завтра злодей.</p>
      <p>Я видел не мало забавных очей,</p>
      <p>Порядочных шлюх и продажных врачей.</p>
      <p>Я видел улыбки, их вез автозак</p>
      <p>Под гнусные вопли прохожих, зевак.</p>
      <p>Я видел запретное, главный секрет</p>
      <p>И трупы нашедших и знавших ответ.</p>
      <p>Я видел как строится эра теней,</p>
      <p>Под крики: "Закуски! Еще мне налей!"</p>
      <p>Я видел заплатки, пробитое дно</p>
      <p>Как вышла девчонка в пустое окно.</p>
      <p>Я видел лишь серое небо и грязь,</p>
      <p>Стоящую в зеркале наглую мразь.</p>
      <p>Я видел тебя и я видел себя,</p>
      <p>Я - это ты, а ты это я...</p>`
    },
    {
      id: 4,
      title: "Я знал, что такое счастье",
      createdAt: "22-02-2019",
      tags: ["любовь", "разное"],
      content: `<p>Я знал, что такое счастье,</p>
      <p>Вдыхая апреля этюды.</p>
      <p>Я шёл сквозь немые ненастья,</p>
      <p>Взирая природы причуды.</p>
      <p>Я чувствовал рук твоих нежность</p>
      <p>В касаниях ветра случайных.</p>
      <p>Я верил, что лишь безмятежность</p>
      <p>Избавит от мыслей печальных.</p>
      <p>Я слышал твой голос в туманах,</p>
      <p>Укрывших речные просторы.</p>
      <p>Я думал тонуть в океанах,</p>
      <p>Отбросив все логики вздоры.</p>
      <p>Я видел твой образ в мерцаньях</p>
      <p>Душных июньских ночей.</p>
      <p>Мой мозг утопал в отрицаньях</p>
      <p>Таких очевидных вещей.</p>
      <p>Но вот сердца стук уже замер</p>
      <p>Доигран последний аккорд.</p>
      <p>Заблудших сознания сканер</p>
      <p>Мне выдал: "Свободен... Вперед..."</p>`
    },
    {
      id: 5,
      title: "Гипотетическая часть линии времени",
      createdAt: "21-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Думать о будущем будем мы</p>
      <p>Те, кому вновь ночами не спится.</p>
      <p>В жаркой пустыне взрастили цветы,</p>
      <p>Чтоб ароматом весны насладиться.</p>
      <p>Думать о будущем будем мы</p>
      <p>Те, кто не просит признания, славы.</p>
      <p>И под насмешки: "Душою юны!"</p>
      <p>Мы возведём непреступные скалы.</p>
      <p>Думать о будущем будем мы</p>
      <p>Те, кто узрел, что другими забылось.</p>
      <p>Пусть и дороги творцов не просты,</p>
      <p>Истинный путь, ничего чтоб не скрылось.</p>
      <p>Думать о будущем будем мы</p>
      <p>Нам и ответить, за всё, что случится.</p>
      <p>Ведь нас судьбой называете вы,</p>
      <p>Самое время нам удалиться.</p>
      <p>Думать о будущем хватит, увы</p>
      <p>Время пришло жизнью напиться.</p>
      <p>Думайте сами, теперь вы вольны,</p>
      <p>Мы настоящим хотим насладиться...</p>`
    },
    {
      id: 6,
      title: "Душа посмотрит в небеса...",
      createdAt: "20-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Душа посмотрит в небеса,</p>
      <p>Ей в грязном теле снова тесно.</p>
      <p>Они с мечтою – полюса,</p>
      <p>Им в сером мире нету места.</p>
      <p>Душа посмотрит в небеса,</p>
      <p>А вдруг ей тихо улыбнешься?</p>
      <p>Она поймет : все неспроста,</p>
      <p>Поверит, ты еще вернешься.</p>
      <p>Душа посмотрит в небеса,</p>
      <p>Как будто там на все ответы.</p>
      <p>Но станет черной полоса,</p>
      <p>Ведь в рай не куплены билеты.</p>
      <p>Душа опустит взгляд, смирится,</p>
      <p>Ей не увидеть там тебя.</p>
      <p>Она заставит вниз спуститься,</p>
      <p>И крышу вновь покину я…</p>`
    },
    {
      id: 7,
      title: "Ш.Д.М.",
      createdAt: "19-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Ты рос сярод шэрых дамоў,</p>
      <p>Халодных, бяздушных будынкаў.</p>
      <p>Ніколі не бачыў сноў,</p>
      <p>Не ведаў у працы прыпынкаў.</p>
      <p>Ты рос сярод бруду і страху,</p>
      <p>Шчасце заўсёды шукаў.</p>
      <p>Ад свету хаваўся на даху,</p>
      <p>І там пра жыццё разважаў.</p>
      <p>Ты рос сярод псеўда-шаблонаў,</p>
      <p>Не гледзячы ў вочы рабам.</p>
      <p>Ты рушыў праз сотні заслонаў,</p>
      <p>Прайшоў гэты шлях ты сам.</p>
      <p>Ты рос ,станавіўся мацней,</p>
      <p>Да мэты сваёй імкнуўся.</p>
      <p>Вядзеш за сабой людзей,</p>
      <p>Ты ў мары сваёй апынуўся…</p>`
    },
    {
      id: 8,
      title: "Шлях паэта",
      createdAt: "18-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Крэслі кавалкі паперы,</p>
      <p>Думкі не ведаюць меры.</p>
      <p>Стоячы сярод змроку,</p>
      <p>Моўчкі не зробіш і кроку.</p>
      <p>Перад табой гарады,</p>
      <p>А ты душой малады.</p>
      <p>Бяжы насустрач прастору,</p>
      <p>У жыцці не бывае паўтору.</p>
      <p>Пішы пра радасць і гора,</p>
      <p>Пра лёс,нябёсы і мора.</p>
      <p>Пра тое,што бачыш і чуеш,</p>
      <p>Так гэты свет уратуеш.</p>
      <p>І калі скончыцца шлях,</p>
      <p>Надыдзе "баль на касцях".</p>
      <p>Хутка станеш чужы,</p>
      <p>А верш твой заўсёды жывы...</p>`
    },
    {
      id: 9,
      title: "Пакаленне X",
      createdAt: "17-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Нам кажуць, што мы пакаленне тых,</p>
      <p>Сярод якіх не будзе ні герояў, ні святых.</p>
      <p>Але ў нас няма душой сляпых…</p>
      <p>І нам не трэба грошаў, сліткаў залатых.</p>
      <p>У сэрцах нашых полымя гарыць.</p>
      <p>У жылах кроў дзядоў мацней бурліць.</p>
      <p>У небе мара чыстая ляціць,</p>
      <p>І вам яе ніколі не спыніць.</p>
      <p>Бо дрэвы вашы ноччу ссеклі,</p>
      <p>Няхай гараць у яркім пекле.</p>
      <p>Вось так старое зруйнавалі,</p>
      <p>Ад нас такога не чакалі.</p>
      <p>Вам падавай любы капрыз?</p>
      <p>Так падайце стралою ўніз!</p>
      <p>Такі ў нас у жыцці дэвіз:</p>
      <p>Мы, пакаленне – ікс.</p>`
    },
    {
      id: 10,
      title: "Тут нарадзіўся...",
      createdAt: "16-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Тут нарадзіўся,тут мой дом,</p>
      <p>Яго баранілі агнём і мячом.</p>
      <p>Тут,дзе дзецьмі гулялі ў вайну,</p>
      <p>Тут,дзе ручай упадае ў раку.</p>
      <p>Тут,дзе ведаеш кожны куток,</p>
      <p>Тут,дзе пазнаеш усе ты здалёк.</p>
      <p>Гэты край Беларуссю завуць,</p>
      <p>Няхай мае думкі ў паветры жывуць.</p>
      <p>Зараз,нажаль,карціна не тая,</p>
      <p>Спяць гарады,чагосьці чакая.</p>
      <p>Мову забылі,забылі сябе,</p>
      <p>Нейкія жахі цяпер у галаве.</p>
      <p>Няма сэнсу жыць без ідэй,</p>
      <p>Хто іх знайшоў,стане мацней.</p>
      <p>У цемры начной убачыў пасланне,</p>
      <p>Людзям несці вярнуцца жаданне.</p>
      <p>Вярнуцца да продкаў,знайсці ўсе вытокі,</p>
      <p>Культуру спазнаць,ведаў патокі.</p>
      <p>Каб ганарыліся нашы сыны,</p>
      <p>Як мы Радзіму сваю збераглі...</p>`
    },
    {
      id: 11,
      title: "Прощание",
      createdAt: "15-02-2019",
      tags: ["философия", "разное"],
      content: `<p>В завершении пишу куплет,</p>
      <p>Не нашел на все ответ.</p>
      <p>Не даю я вам совет,</p>
      <p>Больше светлых мыслей нет.</p>
      <p>И не будет возрождения,</p>
      <p>После спячки долгой пробуждения.</p>
      <p>Под аплодисменты возвращения,</p>
      <p>Не увидят строчек поколения.</p>
      <p>Отупеет нация со временем,</p>
      <p>Станет серым незаметным племенем.</p>
      <p>Только всем на это наплевать,</p>
      <p>Ну и мне конечно им под стать.</p>
      <p>Что еще в конце сказать?</p>
      <p>Если будущего нет,зачем страдать?</p>
      <p>Доживай остатки дней своих,</p>
      <p>Становись похожим на других...</p>`
    },
    {
      id: 12,
      title: "Беларусь",
      createdAt: "14-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Как мне мил мой край родной,</p>
      <p>Такой тихий,зато свой.</p>
      <p>Там,где речки поворот,</p>
      <p>Унесет тебя вперед.</p>
      <p>Как мне милы те места,</p>
      <p>Что на сердце неспроста.</p>
      <p>Ночи темные без сна,</p>
      <p>Те рассветы у костра.</p>
      <p>Как мне мил тот городок,</p>
      <p>О котором мало строк.</p>
      <p>Красоты не описать,</p>
      <p>Раз увидеть и понять...</p>
      <p>Как мне милы все места,</p>
      <p>Все края и города,</p>
      <p>Беларусь у нас одна,</p>
      <p>В моем сердце навсегда.</p>`
    },
    {
      id: 13,
      title: "Поворот",
      createdAt: "13-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Бывает в жизни поворот,</p>
      <p>До счастья сделать один ход,</p>
      <p>Но не решается рука ,</p>
      <p>Нажать на кнопку "старт" слегка.</p>
      <p>Бывает в жизни поворот,</p>
      <p>Ползешь во тьме ,как черный крот.</p>
      <p>Не видишь пламени огня,</p>
      <p>И хочется сойти с ума.</p>
      <p>Бывает в жизни поворот,</p>
      <p>Ты на коне ,как темный лорд.</p>
      <p>Несешь разруху и тоску,</p>
      <p>Терпеть так больше не могу.</p>
      <p>А завтра новый поворот,</p>
      <p>Но я готов свой сделать ход.</p>
      <p>Увидеть пламя от огня ,</p>
      <p>Рассвет пылающего дня.</p>`
    },
    {
      id: 14,
      title: "Болезнь",
      createdAt: "12-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Один мудрец в бреду сказал,</p>
      <p>Любовь болезнью обозвал.</p>
      <p>Его пытались вразумить,</p>
      <p>Но мысли он не дал убить.</p>
      <p>Прошли столетия,года,</p>
      <p>Сменились смутные века.</p>
      <p>Настало время революций,</p>
      <p>Всех восхищал тогда Конфуций.</p>
      <p>Затем технический прогресс,</p>
      <p>Отнюдь не скучный был процесс.</p>
      <p>Меуччи,Белл.О,телефон!</p>
      <p>Стив Джобс придумает айфон.</p>
      <p>Две тысячи пятнадцать лет,</p>
      <p>А на вопрос ответа нет.</p>
      <p>Какой безжалостный недуг,</p>
      <p>Тебя за сердце схватит вдруг?</p>
      <p>Кто изменить тебя готов?</p>
      <p>Кто отберет последний кров?</p>
      <p>Кто из тебя всю выпьет кровь?</p>
      <p>Ответ один,услышь,любовь...</p>`
    },
    {
      id: 15,
      title: "Беспорядок",
      createdAt: "11-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Я привык с детства к порядку,</p>
      <p>Когда все на своих местах.</p>
      <p>И для друга любимую сказку,</p>
      <p>Ты отыщешь,пускай впопыхах.</p>
      <p>Я привык к тишине на рассвете,</p>
      <p>Когда первые солнца лучи,</p>
      <p>Сквозь окно пробиваются в цвете,</p>
      <p>Непонятной ,но чудной весны.</p>
      <p>Я привык к сотням ошибок,</p>
      <p>Без которых и дня не прожить.</p>
      <p>Понаделал в броне своей дырок,</p>
      <p>Чтобы лоск новизны пригубить.</p>
      <p>Только в жизни царит беспорядок.</p>
      <p>На душе нет давно тишины.</p>
      <p>Будто в сердце какой-то осадок,</p>
      <p>И не снятся веселые сны...</p>`
    },
    {
      id: 16,
      title: "Как мало вокруг...",
      createdAt: "10-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Как мало вокруг честных людей,</p>
      <p>Тех,кто не ставит ловчих сетей.</p>
      <p>Тех,кому правда дороже монет,</p>
      <p>Кто пополам разделит обед.</p>
      <p>Как мало вокруг добрых людей,</p>
      <p>Тех,кто накормит птиц и зверей.</p>
      <p>Тех,кто последний рубль отдаст,</p>
      <p>Чтобы не быть,как тяжелый балласт.</p>
      <p>Как мало вокруг справедливых людей,</p>
      <p>Тех,кто рассудит врагов и друзей.</p>
      <p>Тех,кто тебя не бросит в беде,</p>
      <p>Не оставит на темной и лживой земле.</p>
      <p>Как мало вокруг хороших людей,</p>
      <p>Тех,чья душа желает гостей.</p>
      <p>Тех,в ком теплится огонь доброты,</p>
      <p>Кому не нужны пустые понты...</p>`
    },
    {
      id: 17,
      title: "Патриот",
      createdAt: "09-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Мы - не будущее страны.</p>
      <p>Мы - зомбированные изгои.</p>
      <p>Мы не сможем ее спасти,</p>
      <p>После нас не будет покоя.</p>
      <p>Мы - все те,кто душу продал,</p>
      <p>За фальшивые блага обмана.</p>
      <p>И никто из толпы не встал,</p>
      <p>Проложить бы дорогу до рая.</p>
      <p>За улыбкой скрываем гримасы,</p>
      <p>На людей не похожи совсем.</p>
      <p>Мы как серая биомасса,</p>
      <p>Тянем время,рискуя всем.</p>
      <p>Может чары пора развеять?</p>
      <p>Пробудить уснувший народ?</p>
      <p>И начнет страна твоя верить,</p>
      <p>Что не вымер еще патриот.</p>`
    },
    {
      id: 18,
      title: "Не здрадзіць самому сабе",
      createdAt: "08-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Сцяна сумненняў згарэла дашчэнту,</p>
      <p>Скрозь цемру мігоча святло.</p>
      <p>Жыцце надае свайму кліенту</p>
      <p>Не толькі дабро і цяпло.</p>
      <p>Недавер,сумненне і здраду</p>
      <p>Заўседы нясеш за плячыма.</p>
      <p>У твой гонар не будзе параду,</p>
      <p>Глядзі наперад вачыма.</p>
      <p>Праз сотні дарог,у мястэчку,</p>
      <p>Згубіўшы ўсе на шляху.</p>
      <p>Паставіш за родных свечку,</p>
      <p>Спазнаеш спакой,цішыню.</p>
      <p>Прачнецца ў душы пачуцце,</p>
      <p>Няхай зіхаціць у галаве.</p>
      <p>Галоўны дэвіз праз жыцце:</p>
      <p>Не здрадзіць самому сабе...</p>`
    },
    {
      id: 19,
      title: "Адзін 2.0 version",
      createdAt: "07-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Зноў цішыня,і зноў я адзін.</p>
      <p>Колькі чакаць,колькі гадзін?</p>
      <p>Дзе шукаць выйсце альбо ратунак?</p>
      <p>Ці гэта ўсё жыцця падарунак?</p>
      <p>Дзесяткі тысяч кожны дзень паміраюць,</p>
      <p>Тысячы тысяч моўчкі назіраюць.</p>
      <p>Але я не з імі,не ў гэтым я свеце,</p>
      <p>Я на нейкай іншай далекай планеце.</p>
      <p>Нікому не патрэбна чалавечага жыцця,</p>
      <p>А сэрца баліць,яно хоча пачуцця.</p>
      <p>Яно хоча адчуць сапраўдную свабоду,</p>
      <p>Вырвацца хутчэй з душнага дому.</p>
      <p>Але ісці я не ведаю куды,</p>
      <p>Бо ў горадзе родным - нібыта чужы.</p>
      <p>Трэба на вуліцу, там дзе вясна?</p>
      <p>Не ўзрадуе больш прыроды краса.</p>
      <p>За вокнамі сонца,за вокнамі пахі,</p>
      <p>А ў душы адны толькі жахі.</p>
      <p>Сяджу,паведамленні чыісьці чытаю,</p>
      <p>І сам не разумею:чаго я чакаю?</p>`
    },
    {
      id: 20,
      title: "Каханне",
      createdAt: "06-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Не будзе ўсе ў жыцці цудоўна,</p>
      <p>Памылкі робяць людзі нездарма.</p>
      <p>І з часам зразумеем мы раптоўна,</p>
      <p>Што горш за адзіноту,нават не турма.</p>
      <p>Ты кажаш,словы-жарт і несур'езнасць?</p>
      <p>Учынкі вырашаюць усе ў жыцці?</p>
      <p>А я лічу,што словы чалавека яго годнасць.</p>
      <p>Не верыш мне?Ну вось сюды глядзі.</p>
      <p>Я словам перадам, як ты прыгожа,</p>
      <p>Учынак так не зробіць,ен не зможа.</p>
      <p>Я ведаю,што слова цемру пераможа,</p>
      <p>Шапчу аднымі вуснамі:дапамажы мне Божа.</p>
      <p>Я перадам тваей душы ўсю чысціню,</p>
      <p>Ўсю дабрыню,адкрытасць,сэрца цеплыню.</p>
      <p>У моманты сумненняў слухай цішыню,</p>
      <p>Канца цудоўнейшай гісторыі не дапушчу.</p>
      <p>А зараз аднаго жадаю,</p>
      <p>Убачыць цябе,як кавалак раю!</p>
      <p>Казаць у вочы,моцна што кахаю,</p>
      <p>І свае сэрца назаўседы пакідаю...</p>`
    },
    {
      id: 21,
      title: "Свабода",
      createdAt: "05-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Кожны дзень ты зранку прачынаешься,</p>
      <p>Ідзеш у вану,потым апранаешся.</p>
      <p>Накіроўваешся на вучобу ці на працу,</p>
      <p>Увечары глядзішь кіно пра Пацу Вацу.</p>
      <p>А спрабаваў хоць раз забыць пра ўсе?</p>
      <p>Адчуць сапраўднае былое пачуцце?</p>
      <p>Адчуць як у валасах паветра свішча?</p>
      <p>Як ад ваўка бяжыць яго здыбыча?</p>
      <p>Убачыць заход сонца ўвесь прыгожы і бліскучы,</p>
      <p>А потым від Радзімы сэрцу і душы такі балючы.</p>
      <p>Знайсці свой шлях у бетонным лабірынце?</p>
      <p>І жыць як хочацца табе,а не эліце.</p>
      <p>Прайдуць гады ,ўсе зменіцца не раз не два.</p>
      <p>Застанецца ў цябе кавалак хлеба і вада.</p>
      <p>Спытаешь ты аб гэтым неўзабаве,</p>
      <p>А адчуваў свабоду на самой справе?</p>`
    },
    {
      id: 22,
      title: "Без назвы",
      createdAt: "04-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Восень, сумна, дождж ідзе.</p>
      <p>Хутка лісце ападзе.</p>
      <p>Снег пайшоў ,прыдзе мароз.</p>
      <p>Новы год ,цукерак воз.</p>
      <p>Ручаі цякуць паўсюды,</p>
      <p>Я хачу ўбачыць цуды.</p>
      <p>Лета ,сонца,мора,пляж,</p>
      <p>Вось і скончыўся год ваш.</p>
      <p>Так жывуць амаль усе людзі,</p>
      <p>Але мы пра іх не будзем.</p>
      <p>Сам павінен кожны вырашать,</p>
      <p>Ціха спаць ці сцяг жыццевы падымаць?</p>`
    },
    {
      id: 23,
      title: "З днем нараджэння !",
      createdAt: "03-02-2019",
      tags: ["философия", "разное"],
      content: `<p>З днем нараджэння сення павіншую</p>
      <p>І шмат чаго хачу я пажадаць</p>
      <p>Турботаў чарачку малую</p>
      <p>Жыцце ўвесь час у руках трымаць.</p>
      <p>Здароў'я, шчасця - гэта ўсе банальна</p>
      <p>Яны залежаць цалкам ад цябе</p>
      <p>А вось быць чалавекам - гэта файна</p>
      <p>Астатняе само ўсе прыдзе.</p>
      <p>Напрыканцы пра танкі не забуду</p>
      <p>У баях за прадзедаў,за нашых,за дзядоў</p>
      <p>Дапамагаць цябе заўседы буду</p>
      <p>Бо пра вайну павінны ведаць шмат гадоў.</p>
      <p>Ну вось і ўсе, апошнія радкі</p>
      <p>Што атрымалася судзіце вы, не я</p>
      <p>За гэты час я зразумеў-такі</p>
      <p>Галоўнае на свеце - родныя, сям'я!</p>`
    },
    {
      id: 24,
      title: "8 САКАВІКА",
      createdAt: "02-02-2019",
      tags: ["философия", "разное"],
      content: `<p>Прачнуўся зранку,нешта ў жыцці не так?</p>
      <p>Я адчуваю радасць,шчасце,страх.</p>
      <p>Гляджу на белы ліст календара</p>
      <p>Так сёння ж Восьмага сакавіка!</p>
      <p>Віншуем мы дзяўчынак усяго свету</p>
      <p>Не пакідайце ж гэту шэрую планету.</p>
      <p>Без вас яна не будзе так блішчаць,</p>
      <p>А нам не будзе сэнсу працаваць.</p>`
    }
  ];
  return POSTS;
}
